---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpecifySlopeOrOffset
source: html/092d19a9-081b-dc11-80df-81693ac73a40.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpecifySlopeOrOffset Property

"Specify "

## Syntax (C#)
```csharp
public static ForgeTypeId SpecifySlopeOrOffset { get; }
```